# Assignment 4 - Advanced SQL

###### Submitted by Sakshi Shende

###### Date: 29 October 2022

### Installing the following python packages

In [1]:
!pip install pandas
!pip install pymysql

Requirement already satisfied: pandas in c:\users\sakshi\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\sakshi\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\sakshi\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\users\sakshi\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\sakshi\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Requirement already satisfied: pymysql in c:\users\sakshi\anaconda3\lib\site-packages (1.0.2)

### Import the libraries

In [2]:
import pandas as pd
import pymysql

### Establishing a connection between python and MySQL

In [3]:
connection = pymysql.connect(host='localhost',
                             port=3306,
                             user='root',
                             password='rootroot',
                             db='sakila',
                             charset='utf8mb4')

## Q1 - Which movie genres are most popular?

In [4]:
query1 = """
SELECT a.name,
       COUNT(rental_id) AS times_rented
FROM sakila.category a
	JOIN sakila.film_category b
    ON a.category_id = b.category_id
    JOIN sakila.inventory c
    ON b.film_id = c.film_id
    JOIN sakila.rental d
    ON c.inventory_id = d.inventory_id
GROUP BY a.name
ORDER BY times_rented DESC
"""

In [5]:
result1 = pd.read_sql(query1, connection)
result1.head(10)

C:\Users\Sakshi\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

          name  times_rented
0       Sports          1179
1    Animation          1166
2       Action          1112
3       Sci-Fi          1101
4       Family          1096
5        Drama          1060
6  Documentary          1050
7      Foreign          1033
8        Games           969
9     Children           945

## Q2 - Which actors' movies are popular?

In [6]:
query2 = """
SELECT a.actor_id,
	   a.first_name,
       a.last_name,
       COUNT(e.rental_id) AS times_rented
FROM sakila.actor a
	JOIN sakila.film_actor b
    ON a.actor_id = b.actor_id
    JOIN sakila.film c
    ON b.film_id = c.film_id
    JOIN sakila.inventory d
    ON c.film_id = d.film_id
    JOIN sakila.rental e
    ON d.inventory_id = e.inventory_id
GROUP BY a.actor_id
ORDER BY times_rented DESC
"""

In [7]:
result2 = pd.read_sql(query2, connection)
result2.head(10)

C:\Users\Sakshi\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   actor_id first_name    last_name  times_rented
0       107       GINA    DEGENERES           753
1       181    MATTHEW       CARREY           678
2       198       MARY       KEITEL           674
3       144     ANGELA  WITHERSPOON           654
4       102     WALTER         TORN           640
5        60      HENRY        BERRY           612
6       150      JAYNE        NOLTE           611
7        37        VAL       BOLGER           605
8        23     SANDRA       KILMER           604
9        90       SEAN      GUINESS           599

## Q3 - How much business, in dollars, each store brought in?

In [8]:
query3 = """
SELECT d.store_id,
	   f.city,
       g.country,
       SUM(a.amount) AS total_sales
FROM sakila.payment a
	JOIN sakila.rental b
    ON a.rental_id = b.rental_id
    JOIN sakila.inventory c
    ON b.inventory_id = c.inventory_id
    JOIN sakila.store d
    ON c.store_id = d.store_id
    JOIN sakila.address e
    ON d.address_id = e.address_id
    JOIN sakila.city f
    ON e.city_id = f.city_id
    JOIN sakila.country g
    ON f.country_id = g.country_id
GROUP BY d.store_id
ORDER BY  total_sales DESC
"""

In [9]:
result3 = pd.read_sql(query3, connection)
result3.head(10)

C:\Users\Sakshi\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   store_id        city    country  total_sales
0         2   Woodridge  Australia     33726.77
1         1  Lethbridge     Canada     33679.79

## Q4 - List each film and the number of actors who are listed for that film.

In [10]:
query4 = """
SELECT a.film_id,
	   a.title,
	   COUNT(b.actor_id) AS number_of_actor
FROM sakila.film a
	JOIN sakila.film_actor b
	ON a.film_id = b.film_id
GROUP BY a.film_id
ORDER BY number_of_actor DESC
"""

In [11]:
result4 = pd.read_sql(query4, connection)
result4.head(10)

C:\Users\Sakshi\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   film_id                title  number_of_actor
0      508     LAMBS CINCINATTI               15
1       87    BOONDOCK BALLROOM               13
2      146          CHITTY LOCK               13
3      188           CRAZY HOME               13
4      249      DRACULA CRYSTAL               13
5      606      MUMMY CREATURES               13
6      714            RANDOM GO               13
7       34         ARABIA DOGMA               12
8      414  HELLFIGHTERS SIERRA               12
9      517     LESSON CLEOPATRA               12

## Q5 - Display the first and last names, as well as the address, of each staff member.

In [12]:
query5 = """
SELECT a.first_name,
       a.last_name,
       b.address
FROM sakila.staff a
	JOIN sakila.address b
    ON a.address_id = b.address_id
"""

In [13]:
result5 = pd.read_sql(query5, connection)
result5.head(10)

C:\Users\Sakshi\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  first_name last_name               address
0       Mike   Hillyer     23 Workhaven Lane
1        Jon  Stephens  1411 Lillydale Drive